{
  "_num_labels": 5,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ACCOUNTANT",
    "1": "ADVOCATE",
    "2": "AGRICULTURE",
    "3": "APPAREL",
    "4": "ARTS",
    "5": "AUTOMOBILE",
    "6": "AVIATION",
    "7": "BANKING",
    "8": "BPO",
    "9": "BUSINESS-DEVELOPMENT",
    "10": "CHEF",
    "11": "CONSTRUCTION",
    "12": "CONSULTANT",
    "13": "DESIGNER",
    "14": "DIGITAL-MEDIA",
    "15": "ENGINEERING",
    "16": "FINANCE",
    "17": "FITNESS",
    "18": "HEALTHCARE",
    "19": "HR",
    "20": "INFORMATION-TECHNOLOGY",
    "21": "PUBLIC-RELATIONS",
    "22": "SALES",
    "23": "TEACHER"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ACCOUNTANT": 0,
    "ADVOCATE": 1,
    "AGRICULTURE": 2,
    "APPAREL": 3,
    "ARTS": 4,
    "AUTOMOBILE": 5,
    "AVIATION": 6,
    "BANKING": 7,
    "BPO": 8,
    "BUSINESS-DEVELOPMENT": 9,
    "CHEF": 10,
    "CONSTRUCTION": 11,
    "CONSULTANT": 12,
    "DESIGNER": 13,
    "DIGITAL-MEDIA": 14,
    "ENGINEERING": 15,
    "FINANCE": 16,
    "FITNESS": 17,
    "HEALTHCARE": 18,
    "HR": 19,
    "INFORMATION-TECHNOLOGY": 20,
    "PUBLIC-RELATIONS": 21,
    "SALES": 22,
    "TEACHER": 23
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.52.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 50000
}
